In [1]:
1#How many distinct (different) actors' last names are there?
2#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
3#Get all films with ARMAGEDDON in the title.
4#Get 10 the longest films.
5#How many films include Behind the Scenes content?
6#Which kind of movies (rating) have a mean duration of more than two hours?
7#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [21]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass

In [27]:
password = getpass()

········

In [28]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [29]:
type(engine)

sqlalchemy.engine.base.Engine

In [30]:
#question1
data = pd.read_sql_query('SELECT count(distinct last_name) as distinct_lastname from actor', engine)
data.head()

   distinct_lastname
0                121

In [36]:
2#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
data2 = pd.read_sql_query('''SELECT *,
CASE
WHEN (date_format(rental_date,'%%W') = 'Saturday') or (date_format(rental_date,'%%W') = 'Sunday')
THEN 'Weekend' 
ELSE 'Weekday' 
END AS day_type 
FROM sakila.rental''', engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday

In [32]:
3#Get all films with ARMAGEDDON in the title

3

In [37]:
data3 = pd.read_sql_query('''SELECT title from film WHERE title LIKE '%%ARMAGEDDON%%' ''', engine)
data3.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

In [ ]:
4#Get 10 the longest films.

In [38]:
data4 = pd.read_sql_query('''SELECT title from film
order by length desc
limit 10''', engine)
data4.head()

            title
0  DARN FORRESTER
1    POND SEATTLE
2   CHICAGO NORTH
3   MUSCLE BRIGHT
4    WORST BANGER

In [ ]:
5#How many films include Behind the Scenes content?

In [40]:
data5 = pd.read_sql_query('''SELECT COUNT(special_features) FROM film
WHERE special_features LIKE '%%behind the scenes%%' ''', engine)
data5.head()

   COUNT(special_features)
0                      538

In [ ]:
6#Which kind of movies (rating) have a mean duration of more than two hours?

In [41]:
data6 = pd.read_sql_query('''select rating, AVG(length)
from film
group by rating
having AVG(length) > 120''', engine)
data6.head()

  rating  AVG(length)
0  PG-13     120.4439

In [ ]:
7#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [42]:
data7 = pd.read_sql_query('''select title, length, rating
from film
where (length IS NOT NULL) AND (length<>0)
order by length''', engine)
data7.head()

                 title  length rating
0         ALIEN CENTER      46  NC-17
1            IRON MOON      46     PG
2        KWAI HOMEWARD      46  PG-13
3     LABYRINTH LEAGUE      46  PG-13
4  RIDGEMONT SUBMARINE      46  PG-13